from ZelzalMusic import BOT_NAME

PM_START_TEXT = """
ٴ•────✯ ѕʀ_ᴍᴜsɪᴄ ✯───‌‌‏─•
- مرحبـاً عـزيـزي  {0} 
- انا بـوت تشغيـل الميـوزك في المكـالمـات 𝄞
- والمزيـد من الاوامـر اكتشفهـا بنفسـك
- لـ تصفـح اوامـر البـوت اضغـط زر الاوامـر
ٴ•────✯ ѕʀ_ᴍᴜsɪᴄ ✯───‌‌‏─•
"""

START_TEXT = """
ٴ•────✯ ѕʀ_ᴍᴜsɪᴄ ✯───‌‌‏─•
- مرحبـاً عـزيـزي  {0} 
- انا بـوت تشغيـل الميـوزك في المكـالمـات 𝄞
- والمزيـد من الاوامـر اكتشفهـا بنفسـك
- لـ تصفـح اوامـر البـوت والاستخـدام
- قـم بـ الـدخـول الـى البـوت
ٴ•────✯ ѕʀ_ᴍᴜsɪᴄ ✯───‌‌‏─•
"""

HELP_TEXT = f"""
ٴ•────✯ ѕʀ_ᴍᴜsɪᴄ ✯───‌‌‏─•
<u>**- اوامــر التشغيــل :**</u> ✅
ٴ•────✯ ѕʀ_ᴍᴜsɪᴄ ✯───‌‌‏─•
تشغيل + اسم الاغنية
**- لــ تـشـغـيل اغـنـيـة فـي الـمكـالـمـة الـصـوتـيـة**

كتم / اسكت
**- لـ إيقـاف تشغيـل الموسيـقـى فـي المكالمـة مـؤقتـاً**

كمل / الغاء الكتم
**- لـ إسـتـئـنـاف تـشغـيـل الـمـوسـيـقـى فـي المكـالمـة**

تخطي / التالي
**- لـ تخطـي الاغنيـة وتشغيـل الاغنيـة التاليـه**
 
ايقاف / قف
**- لـ إيقـاف تـشغـيـل الـمـوسـيـقـى فـي المكـالمـة**
ٴ⋆┄─┄─┄─┄─┄─┄─┄─┄⋆
بحث + الاسـم
**- لـ تحميـل الاغانـي والمقـاطـع الصوتيـه مـن اليوتيـوب**

ابحث + الاسـم
**- لـ البحث عـن روابـط الاغانـي والمقـاطـع الصوتيـه مـن اليوتيـوب**
ٴ⋆┄─┄─┄─┄─┄─┄─┄─┄⋆
بنج
**- لـ قيـاس سـرعـة تشغيـل البـوت**

المطورين
**- لـ عـرض مطـورين البـوت**
ٴ•────✯ ѕʀ_ᴍᴜsɪᴄ ✯───‌‌‏─•
"""

HELP_SUDO = f"""
ٴ•────✯ ѕʀ_ᴍᴜsɪᴄ ✯───‌‌‏─•
<u>**- اوامــر المطــور :**</u> ✅
ٴ•────✯ ѕʀ_ᴍᴜsɪᴄ ✯───‌‌‏─•
المكالمات
**- لـ معـرفـة المكالمـات فـي البـوت**

/eval
**- لـ التشغيـل علـى محطـة البـوت**

فحص
**- لـ اختبـار وقيـاس سـرعـة السيـرفـر**

الاحصائيات
**- لـ عـرض إحصـائيـات البـوت** 
ٴ⋆┄─┄─┄─┄─┄─┄─┄─┄⋆
/اسم + الاسـم
**- لـ تغييـر اسـم الحسـاب المسـاعـد**

/بايو + البايو
**- لـ تغييـر نبـذة الحسـاب المسـاعـد**

/صورة بالـرد ع صـورة
**- لـ تغييـر صـورة الحسـاب المسـاعـد**

/مسح
**- لـ حذف صـورة الحسـاب المسـاعـد**
ٴ•────✯ ѕʀ_ᴍᴜsɪᴄ ✯───‌‌‏─•
"""

HELP_DEV = f"""
ٴ•────✯ ѕʀ_ᴍᴜsɪᴄ ✯───‌‌‏─•
<u>**- اوامــر المــالك :**</u> ✅
ٴ•────✯ ѕʀ_ᴍᴜsɪᴄ ✯───‌‌‏─•
الفارات
**- لـ جلب فـارات تنصيب البـوت**

اذاعة بالـرد ع نـص او ميديـا
**- لـ عمـل اذاعـة لكـل مشتركيـن البـوت والجروبات**

تنظيف
**- لـ مسـح التخـزيـن المـؤقت لـ البـوت**
- اكتب مغادرة لمغادرة المساعد للجروبات

/مطور + يـوزر
**- لـ رفـع شخـص مطـور فـي البـوت**

/تنزيل + يـوزر
**- لــ تـنزيل شخـص مـن قائمـة مطـوريـن البـوت**
ٴ•────✯ ѕʀ_ᴍᴜsɪᴄ ✯───‌‌‏─•
"""
